{
  "general": {
    "description": "Welcome to the trivia bot! This is a open-source Discord bot designed to allow users to upload and play Kahoot-style question sets right inside Discord! Below is a quickstart guide that should cover the basics. If you need more information on a particular command, use `/info command:<command_name>` to pull up more detailed information.\n\n### Creating new trivia sets.\nCurrently, the bot supports importing trivia sets Google Sheets using the `/addsheet` command. For Google Sheets, you'll need to format the sheet correctly. The info page for the respective commands should provide you with instructions and a template.\n\n### Removing Question Sets\nRemove a question set using the `/removeset` command. Note that you must either be a server administrator the owner of the question set in order to successfully remove a set.\n\n### Playing Trivia\nTo start a text-channel game of trivia, use the `/start` command. You have many customizable parameters including the question set to play, which channel to play in, and whether or not the questions are shuffled. More is soon to come!\n\nAnd with that, you should be good to go! If you still have questions, once again, you can run the `/info` command on other commands for more detailed information.",
    "fields": []
  },

  "addsheet": {
    "description": "Add a question set from Google Sheets, given a valid Google Sheets URL of the form `https://docs.google.com/spreadsheets/<id>`.\n\n**IMPORTANT** - For formatting, leave the first row blank. Questions are treated as the first column of each row. Answer options are then scanned for the next 4 columns of the row. Lastly, the correct answers are scanned from the last column of the row.\n- To format correct answers, use a number. For example `1` would mean that option #1 is correct. To allow for multiple correct answers, use them together: `134` means that options #1, #3, and #4 are correct.\n- To include an image in your question, use `!!img[URL]` before your question.\n\nFor example, `!!img[https://bolivia.png]What is the capital of Bolivia?` would include both an image.\n\nFor a template, see https://tinyurl.com/hootbotsheets.",
    "fields": [
      {
        "name": "Title `(required)` -",
        "value": "The name you wish to give to the question set. This must be unused in the current list of question sets and unique to the new set."
      },
      {
        "name": "Description `(required)` -",
        "value": "The description to add to the question set. This should provide a meaningful summary of what the question set tests as well as specific instructions in how to answer each question."
      },
      {
        "name": "URL `(required)` -",
        "value": "The URL associated with the Google Sheets question set you wish to add."
      }
    ]
  },

  "info": {
    "description": "The `/info` command provides with useful info about the bot and commands such as the `/info` command that provides you with useful info about the bot and commands such as the `/info` command that provides you with useful info about the bot and commands such as the `/info` command...",
    "fields": [
      {
        "name": "Command `(optional)` -",
        "value": "The command you wish to learn more about. If left blank, provides you with general information about the bot."
      }
    ]
  },

  "listsets": {
    "description": "Provides a page of up to 10 question set name-owner pairs to play. If a query is given, provides up to 10 question set name-owner pairs matching the query.",
    "fields": [
      {
        "name": "Page `(optional)` -",
        "value": "The page of the list you wish to start at. If left blank, starts at page 1."
      },
      {
        "name": "Title `(optional)` -",
        "value": "The name you wish to filter by (i.e. 'Capitals'). Only question sets that have a similar name or contain this option will be displayed. If left blank, shows all question sets."
      }
    ]
  },

  "ping": {
    "description": "Pings the bot. If successful, the bot should respond with a `Pong!`",
    "fields": []
  },

  "removeset": {
    "description": "Removes a question set from the question pool.\n**NOTE** - You must either be a server administrator or the owner of the question set in order to do so. You will receive an error otherwise.",
    "fields": [
      {
        "name": "Title `(required)` -",
        "value": "The name of the question set you wish to remove."
      }
    ]
  },

  "setinfo": {
    "description": "Provides more detailed metadata about a question set.",
    "fields": [
      {
        "name": "Title `(required)` -",
        "value": "The name of the question set you wish to request data for."
      }
    ]
  },

  "startgame": {
    "description": "Starts a game of trivia given the parameters. Only one game may be active per channel at a time.",
    "fields": [
      {
        "name": "Question Set `(optional)` -",
        "value": "The name of the question set you wish to play. If left blank, chooses a random question set for you. If no matches are found, errors instead."
      },
      {
        "name": "Shuffle `(optional)` -",
        "value": "Whether or not to shuffle the questions from the original order in the question set. If left blank, shuffles the questions."
      },
      {
        "name": "channel `(optional)` -",
        "value": "The channel you wish the game to be played in. Default: the channel you invoke the command in."
      },
      {
        "name": "time `(optional)` -",
        "value": "The amount of time, in seconds (1-60), per question (20 seconds by default)."
      }
    ]
  }
}
